app/controllers/movies_controller.rb

  def index

    @all_ratings = Movie.all_ratings

    if params[:sort]
      @sort = params[:sort]
    end

    if params[:ratings]
      @ratings = params[:ratings]
    else
      @ratings = {}
      @all_ratings.each do |r|
---
SELECT "movies".* FROM "movies" ORDER BY release_date